// nodejs 是什么?
// nodejs 不是一门新的语言,而是一个可以让js运行在服务端的运行环境;nodejs基于v8引擎;在服务器上安装nodejs以后,就可以用js开发
// 服务端程序了,所以js现在是全栈开发语言;

// 开发一个完整的项目,不仅需要前端,还需要后端;前后端的代码都是保存在服务器上的,前端的代码运行在浏览器中,而后端的代码运行在
// 服务器上;
// 前后端通过http协议通信;前端通过http协议把请求发送给服务器,服务器接收客户端的请求,准备客户端需要的数据,最后通过http协议
// 把数据响应给客户端;

// 服务端要做哪些事情?
// 1. 存储前后端的代码(js/html/css/图片等文件)
// 2. 处理客户端请求
// 3. 响应客户端的请求(把数据发送给客户端)
// 4. 服务器上还能安装数据库,保存用户数据;

// 传统的服务端语言:
// 1. Java
// 2. Php
// 3. C C++
// 4. .net
// 5. python
// 6. Golang (Go语言,可以和NodeJS合作)

// 新贵
// NODEJS

// nodejs的优势
// nodejs可以写任何最新的技术、ES6/ES7任意用，没有兼容性问题；
// 1. 单线程异步，事件驱动；
// 2. 事件驱动的非阻塞I/O,轻量高效;(采用异步的方式处理Input/Output 输入/输出)
// 3. npm 是包管理器, npmjs.com 是全球最大的node开源生态社区;
// 4. npm是随着node一起安装的;
// 5. npm包是别人做好的库,我们只需要安装,然后导入后就可以使用了;

// yarn 也是node包管理器,yarn的特点就是速度快;

// 装 nrm: npm install nrm -g
// nrm 用来切换源(源就是从哪里下载)
// nrm ls 查看所有的源
